[M_EllieDress MissionDefinition]
MissionDescription="Ellie the swordswoman is in charge of protecting the town of [place]Flamerock Refuge[-place]. Unfortunately, she lacks one of the most basic swordswoman's necessities: a set of armor. She's asked you to head to [place]The Dark Forest[-place] and grab something that will protect her."
TeaserText="The best defense..."

[M_EllieDress:EllieDress_FindLessSexyArmor MissionObjectiveDefinition]
ProgressMessage="Find less atrociously-sexist armor"

[M_EllieDress:EllieDress_OS_TurnInChoice MissionObjectiveSetBranchingDefinition]
MissionDescriptionOverride="Ellie the swordswoman is in charge of protecting the town of [place]Flamerock Refuge[-place]. Unfortunately, she lacks one of the most basic swordswoman's necessities: a set of armor. She's asked you to head to [place]The Dark Forest[-place] and grab something that will protect her. As it turns out, you found two different sets of armor -- one skimpy, one bulky. You get to choose which set to give to Ellie."
